// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Päivitä laitteisto-ohjelmisto";

// Errors
FileOpenError = "Tiedostoa %@ ei voida avata.";
FileOpenErrorExplanation = "Tämä tiedosto on vahingoittunut, siirretty toiseen paikkaan, nimetty uudelleen tai poistettu. Tarkista tiedoston sijainti tai valitse toinen tiedosto ja yritä uudelleen.";
PrintChannelOpenError = "Tulostinkanavaa ei voida avata.";
PrintChannelOpenErrorExplanation = "Tarkista, että tulostin on liitetty ja kytketty päälle, ja yritä uudelleen.";
SendDataError = "Tietoja ei voida lähettää tulostimeen.";
SendDataErrorExplanation = "Tarkista, että tulostin on liitetty ja kytketty päälle, ja yritä uudelleen.";

SomePenErrorTitle = "Laitteisto-ohjelmistoa ei voida päivittää.";
DoorOpenMsg = "Laiteohjelmistoa ei voi päivittää, koska kansi on auki. Sulje tulostimen kaikki kannet.";

// Aquamarine Errors
FileCheckError = "Laitteisto-ohjelmistoa ei voida päivittää.";
FileCheckErrorExplanation = "Laitteisto-ohjelmistopaketti ei ole sallittu. Valitse toinen tiedosto ja yritä uudelleen.";

OkButton = "OK";
CancelButton = "Peruuta";
FirmwareUpdateTitle = "Laitteisto-ohjelmiston päivitys";
FirmwareUpdateDeviceState = "Tulostetaan";
FirmwareUpdateCancelingDeviceState = "Peruutetaan";

// Great Wall Messages
PrinterIdleWarning = "Laitteisto-ohjelmiston päivitys saattaa epäonnistua, jos tulostin on varattu (esimerkiksi tulostaa työtä tai kalibroituu).\n\nTarkista, että tulostin on vapaana, ennen kuin jatkat laitteisto-ohjelmiston päivitystä.";
UpdateSuccessful = "Laitteisto-ohjelmistotiedoston lataus onnistui, ja tulostin päivitetään.\n\nKun laitteisto-ohjelmiston päivitys on valmis, tulostin käynnistetään uudelleen automaattisesti.";
InvalidPackage = "Laitteisto-ohjelmistotiedostossa oli virhe, eikä laitteisto-ohjelmistoa voitu päivittää. Virhe saattaa johtua tiedonsiirtovirheestä.\n\nYritä päivittää laitteisto-ohjelmisto uudelleen.\nJos ongelma jatkuu, ota yhteys HP-tukeen.";
FailedDependencies = "Laitteisto-ohjelmistoa ei voitu päivittää riippuvuusongelman vuoksi.\n\nLaitteisto-ohjelmiston nykyinen versio on %@, ja yrität asentaa version %@.\n\nHae tälle tulostimelle sopiva päivityspaketti Internet-osoitteesta\n%@.";
NotNow = "Laitteisto-ohjelmiston päivitys ei onnistunut, koska tulostin on varattu (esimerkiksi käsittelee tai tulostaa työtä).\n\nTarkista, että tulostin on vapaana, ja päivitä laitteisto-ohjelmisto uudelleen.";
TransmissionError = "Siirrossa tapahtui virhe, minkä vuoksi laitteisto-ohjelmiston päivitys ei onnistunut.\n\nTarkista tulostimen liitännät ja päivitä laitteisto-ohjelmisto uudelleen.";
LicenseNotAccepted = "Laitteisto-ohjelmistoa ei voitu päivittää, koska käyttöoikeutta ei ole hyväksytty.";
FatalError = "Tapahtuneiden virheiden vuoksi laitteisto-ohjelmistoa ei voitu päivittää.\n\nJos ongelma jatkuu, ota yhteys HP-tukeen.";

// layout
TaskTitle = "Päivitä laitteisto-ohjelmisto";
TaskDescription = "Valitse tiedosto, joka sisältää laitteisto-ohjelmiston päivityksen, ja siirrä tiedosto tulostimelle päivitystä varten.";
FileNameTitle = "Tiedostonimi:";
FileNameField = "<Ei valittu>";
ChooseButton = "Valitse…";
UpdateButton = "Päivitä";
ProgressPanel = "Päivitys";
FirmwareUpdateProcessTitle = "Päivitetään…";
